[
  {
    "name": "100NINJAS.DEV",
    "link": "https://www.100ninjas.dev",
    "description": "This project is a signature landing page that showcases the expertise of a group of seasoned developers specializing in software, web, and mobile app development. The Contact Form component allows visitors to submit inquiries and sends emails using a custom-built Node.js API. The Rain Animation component utilizes three.js libraries to render a visually stunning rain and cloud animation in the background. The landing page provides an immersive and engaging experience for visitors, while demonstrating the team's technical capabilities in web development, animation, and API integration."
  },
  {
    "name": "Taste of Amor",
    "link": "https://www.tasteofamor.com",
    "description": "This project is a web application for a crepe catering business in Orange County, California. It allows customers to schedule catering services and pay using Stripe API. The application includes a form for customers to fill out, a SuccessMessage for successful payments, a PaymentError for payment errors, an About section, and a responsive design. The project is developed using React.js and Material-UI. Currently under construction."
  },
  {
    "name": "TlaxcalaBakery.com",
    "link": "https://tlaxcalabakery.com",
    "description": "In this website, a Hispanic bakery in Santa Ana, California, promotes its artisanal bread and pastries. The website invites visitors to experience the distinctive flavors and customs of the area with its straightforward and elegant design, which provides a window into the rich history and culture of Mexican baking. To aid users in making wise purchasing judgments, the website also includes trustworthy Yelp evaluations. Tlaxcala Bakery offers a taste of Mexico that's ideal for any occasion with an emphasis on authenticity and quality."
  },
  {
    "name": "Form Validation - Blackbird Australia",
    "link": "https://blackbird-harrison-ai-stasap.vercel.app",
    "description": "Using the email-validator library and unique password requirements, input validation for a form with an email and password was implemented. The use of existing components allows for the display of success and error messages. My ability to combine pre-existing components for success and error message display and to leverage third-party libraries for input validation is demonstrated by this project."
  },
  {
    "name": "Packet Latency - Cisco Demo",
    "link": "https://www.youtube.com/watch?v=eas8J5PdjdQ",
    "description": "The project intends to provide a network delay indicator in order to finish the Minimal Viable Product (MVP) dubbed Sextant. The lightweight Node server Pylon, which transmits time-stamped packets to connected clients, will be used to calculate the latency. The project also makes requests for IPv4 and IPv6 addresses using the ipify API."
  },
  {
    "name": "FurnitureMovers.com",
    "link": "https://www.furnituremovers.com",
    "description": "Developed experience with web scraping tools, including BeautifulSoup and Python Requests, as well as with APIs and working with JSON/XML data. Demonstrated proficiency in Python and familiarity with web scraping best practices, including rate-limiting. Debugged and troubleshooted scraping issues."
  },
  {
    "name": "Vidoozles",
    "link": "https://vidoozles-git-main-stasap.vercel.app",
    "description": "Developed and implemented a React-based web application utilizing blockchain technology to create and sell non-fungible tokens (NFTs). Implemented user authentication via Metamask and authorization for secure buying and selling of NFTs. Utilized React hooks and functional components for efficient and maintainable code."
  }
]
